app/controllers/aircraft_documents_controller.rb

  def index
    @aircraft_documents = AircraftDocument.all
---
SELECT "aircraft_documents".* FROM "aircraft_documents"

    def set_aircraft_document
      @aircraft_document = AircraftDocument.find(params[:id])
---
SELECT "aircraft_documents".* FROM "aircraft_documents" WHERE "aircraft_documents"."id" = ? LIMIT 1  [["id", "1"]]