app/controllers/amms_controller.rb

  def index
    @amms = Amm.all
---
SELECT "amms".* FROM "amms"

    def set_amm
      @amm = Amm.find(params[:id])
---
SELECT "amms".* FROM "amms" WHERE "amms"."id" = ? LIMIT 1  [["id", "show"]]