app/controllers/ipc_seats_controller.rb

  def index
    @ipc_seats = IpcSeat.all
---
SELECT "ipc_seats".* FROM "ipc_seats"