app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = '111@test.de' LIMIT 1
---
	def create
>>>>>>> 6f2a9d9b68c988ed496642a8770928cffa6476e5
    user = User.find_by(email: params[:session][:email].downcase)