app/controllers/smp_referenzs_controller.rb

SELECT "smp_referenzs".* FROM "smp_referenzs"
---
  def index
    @smp_referenzs = SmpReferenz.all